#  0. Вывести квадрат числа

def square_of_number(n):
    print(n * n)


a = int(input("Введите число:"))
square_of_number(a)
