# 2. Даны два числа. Показать большее и меньшее число

first_number = 78
second_number = 35

if first_number > second_number:
    print(f'Большее {first_number}, меньшее {second_number}')
else:
    print(f'Большее {second_number}, меньшее {first_number}')
